<?php

// для работы скрипта необходимо расширение включить mb_string в php.ini

echo "8. *Повторить третье задание, но вывести на экран только города, начинающиеся с буквы «К».<hr>";

$regions = [
    "Московская область" => ["Москва", "Зеленоград", "Клин"],
    "Ленинградская область" => ["Санкт-Петербург", "Всеволжск", "Павловск", "Кронштадт"],
    "Амурская область" => ["Благовещенск", "Белогорск", "Свободный"]
];

foreach ($regions as $region => $cities){
    echo "$region: <br>";
    foreach ($cities as $city){
		if (mb_substr($city, 0, 1) == "К"){
			echo $city;
		}
	}
	echo "<br>";
}
